public class third {
    /**
     * @param args
     */
    public static void main(String[] args) {
        StringBuffer sb = new StringBuffer(
                """     З далекого туману, з тихих озер загірної комуни шелестить шелест:то йде Марія.
                        Я виходжу на безгранні поля, проходжу перевали і там, де жевріють кургани, похиляюсь на самотню пустельну скелю.
                        Я дивлюсь в даль. — Тоді дума за думою, як амазонянки,джигітують навколо мене. Тоді все пропадає...
                        Таємні вершники летять, ритмічно похитуючись, до отрогів, і гасне день; біжить у могилах дорога, а за нею — мовчазний степ...\s
                        Я одкидаю вії і згадую... воістину моя мати — втілений прообраз тієї надзвичайної Марії\s""");
        String[] words = sb.toString().split("\\s+");
    }
}
